Kotokinn/ESP32_watermeterweb/src/main.cpp
// #include <WiFi.h>
// #include <ESPAsyncWebServer.h>
// #include <DNSServer.h>
// #include <ArduinoJson.h>
// #include <SPIFFS.h>
// #include <freertos/FreeRTOS.h>
// #include <freertos/task.h>
// #include <freertos/semphr.h>

// #define CONFIGURATION_FILE "/config.json"

// const char *ssid = "ESP32_AP";
// AsyncWebServer server(80);
// DNSServer dnsServer;
// class ModelData
// {
// private:
//     char hostname[64];
//     char path[64];
//     char port[16];
//     char chuki[64];
//     char doSang[64];
//     char top[16];
//     char left[16];
//     char right[16];
//     char bott[16];
//     char tenKH[64];
//     char SDB[64];
//     char idDevice[64];
//     char PDN[64];

// public:
//     // Setters
//     void setTenKH(const String &value)
//     {
//         snprintf(tenKH, sizeof(tenKH), "%s", value.c_str());
//     }

//     void setSDB(const String &value)
//     {
//         snprintf(SDB, sizeof(SDB), "%s", value.c_str());
//     }

//     void setIDDevice(const String &value)
//     {
//         snprintf(idDevice, sizeof(idDevice), "%s", value.c_str());
//     }

//     void setPDN(const String &value)
//     {
//         snprintf(PDN, sizeof(PDN), "%s", value.c_str());
//     }

//     void setHostname(const String &value)
//     {
//         snprintf(hostname, sizeof(hostname), "%s", value.c_str());
//     }

//     void setPath(const String &value)
//     {
//         snprintf(path, sizeof(path), "%s", value.c_str());
//     }

//     void setPort(const String &value)
//     {
//         snprintf(port, sizeof(port), "%s", value.c_str());
//     }

//     void setChuki(const String &value)
//     {
//         snprintf(chuki, sizeof(chuki), "%s", value.c_str());
//     }

//     void setDoSang(const String &value)
//     {
//         snprintf(doSang, sizeof(doSang), "%s", value.c_str());
//     }

//     void setTop(const String &value)
//     {
//         snprintf(top, sizeof(top), "%s", value.c_str());
//     }

//     void setLeft(const String &value)
//     {
//         snprintf(left, sizeof(left), "%s", value.c_str());
//     }

//     void setRight(const String &value)
//     {
//         snprintf(right, sizeof(right), "%s", value.c_str());
//     }

//     void setBott(const String &value)
//     {
//         snprintf(bott, sizeof(bott), "%s", value.c_str());
//     }

//     // Getters
//     const char *getTenKH() const { return tenKH; }
//     const char *getSDB() const { return SDB; }
//     const char *getIDDevice() const { return idDevice; }
//     const char *getPDN() const { return PDN; }
//     const char *getHostname() const { return hostname; }
//     const char *getPath() const { return path; }
//     const char *getPort() const { return port; }
//     const char *getChuki() const { return chuki; }
//     const char *getDoSang() const { return doSang; }
//     const char *getTop() const { return top; }
//     const char *getLeft() const { return left; }
//     const char *getRight() const { return right; }
//     const char *getBott() const { return bott; }
// };
// ModelData model;

// void saveToFile(const String &jsonString)
// {
//     if (!SPIFFS.begin(true))
//     {
//         Serial.println("SPIFFS Mount Failed");
//         return;
//     }

//     File file = SPIFFS.open("/config.json", "w");
//     if (!file)
//     {
//         Serial.println("Failed to open file for writing");
//         return;
//     }

//     file.print(jsonString);
//     file.close();
//     Serial.println("Data saved successfully!");
// }

// void loadDefaultConfig()
// {
//     StaticJsonDocument<1024> doc;
//     doc["hostname"] = "http://14.224.158.56";
//     doc["path"] = "/donghonuoc/upload";
//     doc["port"] = "8081";
//     doc["chuki"] = "1";
//     doc["dosang"] = "6";
//     doc["top"] = "6";
//     doc["left"] = "6";
//     doc["right"] = "6";
//     doc["bottom"] = "6";
//     doc["tenKH"] = "Default";
//     doc["SDB"] = "000000";
//     doc["idDevice"] = "3";
//     doc["PDN"] = "69";

//     if (doc.containsKey("hostname"))
//         model.setHostname(doc["hostname"]);
//     if (doc.containsKey("path"))
//         model.setPath(doc["path"].as<String>());
//     if (doc.containsKey("port"))
//         model.setPort(doc["port"]);
//     if (doc.containsKey("chuki"))
//         model.setChuki(doc["chuki"]);
//     if (doc.containsKey("dosang"))
//         model.setDoSang(doc["dosang"]);
//     if (doc.containsKey("top"))
//         model.setTop(doc["top"]);
//     if (doc.containsKey("left"))
//         model.setLeft(doc["left"]);
//     if (doc.containsKey("right"))
//         model.setRight(doc["right"]);
//     if (doc.containsKey("bottom"))
//         model.setBott(doc["bottom"]);
//     if (doc.containsKey("tenKH"))
//         model.setTenKH(doc["tenKH"]);
//     if (doc.containsKey("SDB"))
//         model.setSDB(doc["SDB"]);
//     if (doc.containsKey("idDevice"))
//         model.setIDDevice(doc["idDevice"]);
//     if (doc.containsKey("PDN"))
//         model.setPDN(doc["PDN"]);
// }
// // Function to load data from SPIFFS and return a ModelData object
// void loadFromFile(ModelData &model) // note
// {

//     if (!SPIFFS.begin())
//     {
//         Serial.println("Failed to mount SPIFFS");
//         Serial.println("\nusing default setting");
//         loadDefaultConfig();
//     }

//     File file = SPIFFS.open(CONFIGURATION_FILE, "r");
//     if (!file) // file config not found using default setting
//     {
//         Serial.println("Failed to open file for reading");
//         Serial.println("\nusing default setting");
//         loadDefaultConfig();
//     }
//     else
//     {
//         StaticJsonDocument<1024> doc;
//         DeserializationError error = deserializeJson(doc, file);
//         if (error)
//         {
//             Serial.println("Failed to parse JSON");
//             Serial.println("\nusing default setting");
//             loadDefaultConfig();
//         }
//         else
//         {
//             if (doc.containsKey("hostname"))
//                 model.setHostname(doc["hostname"]);
//             if (doc.containsKey("path"))
//                 model.setPath(doc["path"].as<String>());
//             if (doc.containsKey("port"))
//                 model.setPort(doc["port"]);
//             if (doc.containsKey("chuki"))
//                 model.setChuki(doc["chuki"]);
//             if (doc.containsKey("dosang"))
//                 model.setDoSang(doc["dosang"]);
//             if (doc.containsKey("top"))
//                 model.setTop(doc["top"]);
//             if (doc.containsKey("left"))
//                 model.setLeft(doc["left"]);
//             if (doc.containsKey("right"))
//                 model.setRight(doc["right"]);
//             if (doc.containsKey("bottom"))
//                 model.setBott(doc["bottom"]);
//             if (doc.containsKey("tenKH"))
//                 model.setTenKH(doc["tenKH"]);
//             if (doc.containsKey("SDB"))
//                 model.setSDB(doc["SDB"]);
//             if (doc.containsKey("idDevice"))
//                 model.setIDDevice(doc["idDevice"]);
//             if (doc.containsKey("PDN"))
//                 model.setPDN(doc["PDN"]);
//         }
//     }
//     file.close(); // close file after reading
// }

// const char html_page[] PROGMEM = R"rawliteral(
// <!DOCTYPE html>
// <html lang="en">

// <head>
//     <meta charset="UTF-8">
//     <meta name="viewport" content="width=device-width, initial-scale=1.0">
//     <title>Đồng hồ nước</title>
//     <style>
//         .main-container {
//             display: flex;
//             flex-direction: column;
//             gap: 8px;
//             width: 350px;
//             margin: 0 auto;
//         }

//         .Container {
//             padding: 8px;
//             display: flex;
//             flex-wrap: wrap;
//             gap: 8px;
//         }

//         .BoxInput {
//             flex-grow: 1;
//             width: 500px;
//             height: 30px;
//             display: flex;
//             flex-basis: 600px;
//             justify-content: space-between;
//         }

//         .title {
//             color: rgb(14, 14, 207);
//             text-align: center;
//         }

//         .ContainerBoxInput .inputItem {
//             width: 50px;
//         }

//         .ContainerBoxInput {
//             width: 170px;
//         }

//         .tab {
//             display: flex;
//             border-bottom: 2px solid #ccc;
//             background-color: #f1f1f1;
//         }

//         .tab-button {
//             width: 50%;
//             background-color: inherit;
//             border: none;
//             outline: none;
//             padding: 14px 20px;
//             cursor: pointer;
//             transition: background-color 0.3s;
//             font-size: 16px;
//             border-bottom: 2px solid transparent;
//         }

//         .tab-button:hover {
//             background-color: #ddd;
//         }

//         .tab-button.active {
//             border-bottom: 2px solid #007bff;
//             font-weight: bold;
//             background-color: #fff;
//         }

//         .tab-form {
//             display: none;
//         }

//         .tab-form.form-active {
//             display: block;
//         }

