Kotokinn/ESP32_watermeterweb/src/main.cpp
//         .btn-check {
//             background-color: #f28b82;
//             /* Light red */
//             color: #7b1b1b;
//             /* Dark red text for contrast */
//             padding: 10px 10px;
//             font-size: 16px;
//             border: none;
//             border-radius: 4px;
//             cursor: pointer;
//             transition: background-color 0.3s, box-shadow 0.2s, transform 0.1s;
//             box-shadow: 0 2px 5px rgba(242, 139, 130, 0.5);
//             display: flex;
//             justify-content: center;
//         }
//         .misterious-space {
//             height: 45vh;
//         }
//     </style>
// </head>

// <body>
//     <div class="main-container">
//         <h2 class="title">Đồng hồ nước</h2>
//         <div class="tab">
//             <button class="tab-button active">Setting config</button>
//             <button class="tab-button">Get status</button>
//         </div>

//         <form class="tab-form form-active" action="/data" method="post">
//             <h3>Cấu hình server</h3>
//             <div class="Container">
//                 <div class="BoxInput"><span>Hostname</span><input required value="%HOSTNAME%" name="hostname"
//                         type="text" placeholder="vd:example.com"></div>
//                 <div class="BoxInput"><span>Path:</span><input required value="%PATH%" name="path" type="text"
//                         placeholder="vd:/sub/nest"></div>
//                 <div class="BoxInput"><span>Port:</span><input required value="%PORT%" name="port" type="text"
//                         placeholder="0">
//                 </div>
//                 <div class="BoxInput">
//                     <span>Chu kì ảnh tải lên:</span>
//                     <div class="ContainerBoxInput">
//                         <input required style="width: 62%; height: 80%;" class="inputItem" name="chuki" value="%CHUKI%" type="text"
//                             placeholder="0">
//                         <select style="height: 96%;" name="donvichuki" id="">
//                             <option value="86400">Ngày</option>
//                         </select>
//                     </div>
//                 </div>
//                 <div class="BoxInput"><span>Độ sáng khi chụp:</span><input required value="%DOSANG%" name="dosang"
//                         type="text" placeholder="0"></div>
//                 <div class="BoxInput">
//                     <label for="options">Loại đồng hồ:</label>
//                     <select class="option-select" id="options" name="options">
//                         <option value="">Select</option>
//                         <option value="Zenner DN40">Zenner DN40</option>
//                         <option value="George kent DN15">George kent DN15</option>
//                     </select>
//                 </div>
//                 <div class="BoxInput"><span>Cắt ảnh(Top):</span><input required value="%TOP%" name="cropTop"
//                         type="number" placeholder="0"></div>
//                 <div class="BoxInput"><span>Cắt ảnh(Left):</span><input required value="%LEFT%" name="cropLeft"
//                         type="number" placeholder="0"></div>
//                 <div class="BoxInput"><span>Cắt ảnh(Right):</span><input required value="%RIGHT%" name="cropRight"
//                         type="number" placeholder="0"></div>
//                 <div class="BoxInput"><span>Cắt ảnh(Bottom):</span><input required value="%BOTTOM%" name="cropBottom"
//                         type="number" placeholder="0"></div>
//             </div>
//             <h3>Thông tin khách hàng</h3>
//             <div class="Container">
//                 <div class="BoxInput"><span>Tên: </span><input required value="%TENKH%" name="tenKH" type="text"
//                         placeholder="vd: toi la UwU"></div>
//                 <div class="BoxInput"><span>Số danh bộ: </span><input required value="%SDB%" name="SDB" type="text"
//                         placeholder="vd: bột tôm"></div>
//                 <div class="BoxInput"><span>ID thiết bị: </span><input required value="%IDDEVICE%" name="idDevice"
//                         type="text" placeholder="vd:UwU" disabled></div>
//             </div>
//             <h3>Cấu hình NB IOT</h3>
//             <div class="Container">
//                 <div class="BoxInput"><span>Tên PDN: </span><input required value="%PDN%" name="PDN" type="text"
//                         placeholder="vd: toi la UwU"></div>
//             </div>
//             <button type="submit">Submit</button>
//         </form>

//         <form class="tab-form">
//             <div id="status-output">
//                 <p id="net-status">đăng kí mạng....%CHECK_SIM%</p>
//                 <p id="serial-status">kết nối serial....</p>
//                 <p id="image-status">kiểm tra gửi ảnh....</p>
//                 <p id="disconnect-status">Connected.</p>
//             </div>
//             <div class="misterious-space"></div>
//             <div class="btn-check">Disconnect web</div>
//         </form>
//     </div>
// </body>
// <script>
//     document.addEventListener("DOMContentLoaded", function () {

//         let ws = new WebSocket(`ws://${window.location.hostname}/ws`);
//         ws.onmessage = function(event) {
//             console.log('Received:', event.data);
//             document.getElementById('net-status').innerText = event.data;
//         };

//         const btn_disconnect = document.querySelector('.btn-check');
//         btn_disconnect.addEventListener('click', () => {
//             fetch('/disconnect')
//             document.getElementById('disconnect-status').textContent = "Disconnected";
//                 // .then(res => res.json())
//                 // .then(data => {
//                     // Update each status line
//                 // })
//                 // .catch(err => {
//                     // console.error('ESP request failed:', err);
//                 // });
//         });

//         //btn_check.addEventListener('click', () => {
//             document.getElementById('net-status').textContent = "đăng kí mạng....checkin";
//             document.getElementById('serial-status').textContent = "kết nối serial....checkin";
//             document.getElementById('image-status').textContent = "kiểm tra gửi ảnh....checkin";
//             // document.getElementById('disconnect-status').textContent = "bắt đầu ngắt kết nối trong 69 giây.";
//             setTimeout(() => {
//                 //fetch("/status") // you need to define this endpoint on ESP32
//                 //.then(res => res.json())
//                 //.then(data => {
//                     document.getElementById('net-status').textContent ="đăng kí mạng....%SIM%";
//                     document.getElementById('serial-status').textContent ="kết nối serial....%SERIAL%";
//                     document.getElementById('image-status').textContent = "kiểm tra gửi ảnh....%IMAGE%";
//                     //document.getElementById('disconnect-status').textContent ="Disconnect after ";
//                 //})
//                 //.catch(err => {
//                 //    console.error('ESP request failed:', err);
//                 //});
//             }, 5000)
//     //});

//         // button tab
//         const buttons = document.querySelectorAll('.tab-button');
//         const forms = document.querySelectorAll('.tab-form');

