Kotokinn/ESP32_watermeterweb/src/main.cpp
//         buttons.forEach((btn, index) => {
//             btn.addEventListener('click', () => {
//                 // Remove active state from all buttons
//                 buttons.forEach(b => b.classList.remove('active'));
//                 // Hide all forms
//                 forms.forEach(f => f.classList.remove('form-active'));
//                 // Activate clicked button
//                 btn.classList.add('active');
//                 // Show the corresponding form
//                 forms[index].classList.add('form-active');
//             });
//         });

//         const hostname = document.querySelector('input[name="hostname"]');
//         const path = document.querySelector('input[name="path"]');
//         const port = document.querySelector('input[name="port"]');
//         const chuki = document.querySelector('input[name="chuki"]');
//         const donvi_chuki = document.querySelector('input[name="donvichuki"]');
//         const dosang = document.querySelector('input[name="dosang"]');

//         const top = document.querySelector('input[name="cropTop"]');
//         const left = document.querySelector('input[name="cropLeft"]');
//         const right = document.querySelector('input[name="cropRight"]');
//         const bottom = document.querySelector('input[name="cropBottom"]');
//         const optionValue = document.querySelector('select[name="options"]');

//         const tenKH = document.querySelector('input[name="tenKH"]');
//         const SDB = document.querySelector('input[name="SDB"]');
//         const PDN = document.querySelector('input[name="PDN"]');

//         function checkValueToDefault(component, defaultValue) {
//             return component.value != null ? component.value : defaultValue;
//         }

//         function sendData(event) {
//             event.preventDefault(); // Prevent default form submission

//             // Collect form data
//             let formData = {
//                 hostname: hostname.value,
//                 path: path.value,
//                 port: port.value,
//                 chuki: chuki.value * donvi_chuki.value,
//                 dosang: dosang.value,
//                 cropTop: top.value,
//                 cropLeft: left.value,
//                 cropRight: right.value,
//                 cropBott: bottom.value,
//                 tenKH: tenKH.value,
//                 SDB: SDB.value,
//                 PDN: PDN.value
//             };

//             fetch("/data", {
//                 method: "POST",
//                 headers: { "Content-Type": "application/json" },
//                 body: JSON.stringify(formData)
//             })
//         }

//         function handleOnChangeSelect() {
//             // console.log("Dropdown changed:", optionValue.value); // Debugging output

//             const isDisabled = optionValue.value === "";
//             if (isDisabled) {
//                 top.disabled = !isDisabled;
//                 left.disabled = !isDisabled;
//                 right.disabled = !isDisabled;
//                 bottom.disabled = !isDisabled;
//             } else {
//                 top.disabled = !isDisabled;
//                 left.disabled = !isDisabled;
//                 right.disabled = !isDisabled;
//                 bottom.disabled = !isDisabled;

//                 if (optionValue.value === "Zenner DN40") {
//                     top.value = 222;
//                     right.value = 222;
//                     left.value = 222;
//                     bottom.value = 222;
//                 } else {
//                     top.value = 33;
//                     right.value = 33;
//                     left.value = 33;
//                     bottom.value = 33;
//                 }
//             }
//         }

//         // Initialize correct state on load
//         handleOnChangeSelect();

//         checkValueToDefault(hostname, "14.224.158.56");
//         checkValueToDefault(path, "some/path");
//         checkValueToDefault(port, "8080");
//         checkValueToDefault(chuki, "2");
//         checkValueToDefault(donvi_chuki, "60");
//         checkValueToDefault(dosang, "6");
//         checkValueToDefault(top, "6");
//         checkValueToDefault(left, "6");
//         checkValueToDefault(right, "6");
//         checkValueToDefault(bottom, "6");
//         checkValueToDefault(tenKH, "6");
//         checkValueToDefault(SDB, "6");
//         checkValueToDefault(PDN, "6");

//         // Add event listener (this ensures it works dynamically)
//         optionValue.addEventListener("change", handleOnChangeSelect);
//     });
// </script>
// )rawliteral";

// void CheckValueExist(JsonDocument &doc, const String &input, const char *keyName)
// {
//     if (!input.isEmpty())
//         doc[keyName] = input.c_str();
// }

// // declare void
// void Web_task(void *pvParameters);
// void TachMessage(char response[]);

// void setup()
// {
//     Serial.begin(115200);
//     WiFi.softAP(ssid);
//     loadFromFile(model);
//     Serial.println("Access Point Started");
//     dnsServer.start(53, "*", WiFi.softAPIP());

//     server.onNotFound([](AsyncWebServerRequest *request)
//                       { request->redirect("/"); });

//     server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
//               {
//                   String page = FPSTR(html_page);
//                   page.replace("%HOSTNAME%",model.getHostname());
//                   page.replace("%PATH%", model.getPath());
//                   page.replace("%PORT%", model.getPort());
//                   page.replace("%CHUKI%", model.getChuki());
//                   page.replace("%DOSANG%", model.getDoSang());
//                   page.replace("%TOP%", model.getTop());
//                   page.replace("%LEFT%", model.getLeft());
//                   page.replace("%RIGHT%", model.getRight());
//                   page.replace("%BOTTOM%", model.getBott());
//                   page.replace("%TENKH%", model.getTenKH());
//                   page.replace("%SDB%", model.getSDB());
//                   page.replace("%IDDEVICE%", model.getIDDevice());
//                   page.replace("%PDN%", model.getPDN());

//                   //status checking
//                   page.replace("%SIM%", "OK");
//                   page.replace("%SERIAL%", "OK");
//                   page.replace("%IMAGE%", "NO OK");

