Kotokinn/ESP32_watermeterweb/src/main.cpp
//                   request->send(200, "text/html; charset=utf-8", page); });

//     server.on("/data", HTTP_POST, [](AsyncWebServerRequest *request)
//               {
//         StaticJsonDocument<512> doc;

//         // Serial.printf(model.getHostname());

//         if (request->hasParam("tenKH", true)) CheckValueExist(doc,request->getParam("tenKH", true)->value(),"tenKH");
//         if (request->hasParam("path", true)) CheckValueExist(doc,request->getParam("path", true)->value(),"path");
//         if (request->hasParam("port", true)) CheckValueExist(doc,request->getParam("port", true)->value(),"port");
//         if (request->hasParam("chuki", true)) CheckValueExist(doc,request->getParam("chuki", true)->value(),"chuki");
//         if (request->hasParam("dosang", true)) CheckValueExist(doc,request->getParam("dosang", true)->value(),"dosang");
//         if (request->hasParam("cropTop", true)) CheckValueExist(doc,request->getParam("cropTop", true)->value(),"top");
//         if (request->hasParam("idDevice", true)) CheckValueExist(doc,request->getParam("idDevice", true)->value(),"idDevice");
//         if (request->hasParam("cropLeft", true)) CheckValueExist(doc,request->getParam("cropLeft", true)->value(),"left");
//         if (request->hasParam("hostname", true)) CheckValueExist(doc,request->getParam("hostname", true)->value(),"hostname");
//         if (request->hasParam("cropRight", true)) CheckValueExist(doc,request->getParam("cropRight", true)->value(),"right");
//         if (request->hasParam("cropBottom", true)) CheckValueExist(doc,request->getParam("cropBottom", true)->value(),"bottom");
//         if (request->hasParam("SDB", true)) CheckValueExist(doc,request->getParam("SDB", true)->value(),"SDB");
//         if (request->hasParam("PDN", true)) CheckValueExist(doc,request->getParam("PDN", true)->value(),"PDN");

//         String jsonString;
//         serializeJson(doc, jsonString);
//         saveToFile(jsonString);

//         Serial.println("Received and Saved JSON: " + jsonString);
//         request->send(200, "text/html","i was here"); });

//     server.on("/disconnect", HTTP_GET, [](AsyncWebServerRequest *request)
//               { Serial.printf("Disconneting server");
//                 server.reset();
//                 WiFi.disconnect(true); });

//     // server.on("/status", HTTP_GET, [](AsyncWebServerRequest *request)
//     //           {
//     // StaticJsonDocument<256> doc;
//     // doc["net"] = "OK";
//     // doc["serial"] = "Connected";
//     // doc["image"] = "Sent";
//     // doc["disconnect"] = "10s";
//     // String response;
//     // serializeJson(doc, response);
//     // request->send(200, "application/json", response); });

//     server.begin();

//     xTaskCreatePinnedToCore(
//         Web_task,   // Hàm loop chạy trên Core 0
//         "Web_task", // Tên task
//         4096,       // Stack size
//         NULL,       // Tham số
//         1,          // Priority
//         NULL,       // Task handle
//         0           // Core 0
//     );
// }
// // func

// void loop()
// {
// }
// // task

// void Web_task(void *pvParameters)
// {

//     for (;;)
//     {
//         dnsServer.processNextRequest();
//         vTaskDelay(10 / portTICK_PERIOD_MS); // delay nhỏ
//     }
// }

#include <Arduino.h>
#include <DNSServer.h>
#ifdef ESP32
#include <AsyncTCP.h>
#include <WiFi.h>
#elif defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESPAsyncTCP.h>
#elif defined(TARGET_RP2040)
#include <WebServer.h>
#include <WiFi.h>
#endif

#include <StreamString.h>
#include <ESPAsyncWebServer.h>
#include <LittleFS.h>

#include "StreamConcat.h"

DNSServer dnsServer;
AsyncWebServer server(80);

void setup()
{
    Serial.begin(115200);

    LittleFS.begin();

#ifndef CONFIG_IDF_TARGET_ESP32H2
    WiFi.mode(WIFI_AP);
    WiFi.softAP("esp-captive");

    dnsServer.start(53, "*", WiFi.softAPIP());
#endif

    File file1 = LittleFS.open("/header.html", "w");
    file1.print("<html><head><title>ESP Captive Portal</title><meta http-equiv=\"refresh\" content=\"1\"></head><body>");
    file1.close();

    File file2 = LittleFS.open("/body.html", "w");
    file2.print("<h1>Welcome to ESP Captive Portal</h1>");
    file2.close();

    File file3 = LittleFS.open("/footer.html", "w");
    file3.print("</body></html>");
    file3.close();

    server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
              {
    File header = LittleFS.open("/header.html", "r");
    File body = LittleFS.open("/body.html", "r");
    StreamConcat stream1(&header, &body);

    StreamString content;
#if defined(TARGET_RP2040)
    content.printf("FreeHeap: %d", rp2040.getFreeHeap());
#else
    content.printf("FreeHeap: %" PRIu32, ESP.getFreeHeap());
#endif
    StreamConcat stream2 = StreamConcat(&stream1, &content);

    File footer = LittleFS.open("/footer.html", "r");
    StreamConcat stream3 = StreamConcat(&stream2, &footer);

    request->send(stream3, "text/html", stream3.available());
    header.close();
    body.close();
    footer.close(); });

    server.onNotFound([](AsyncWebServerRequest *request)
                      { request->send(404, "text/plain", "Not found"); });

    server.begin();
}

uint32_t last = 0;

void loop()
{
    // dnsServer.processNextRequest();

    if (millis() - last > 2000)
    {
#if defined(TARGET_RP2040)
        Serial.printf("FreeHeap: %d", rp2040.getFreeHeap());
#else
        Serial.printf("FreeHeap: %" PRIu32, ESP.getFreeHeap());
#endif
        last = millis();
    }
}